       IDENTIFICATION DIVISION.
      *    DEMONSTRANDO CONSTANTES
       PROGRAM-ID. PROG2.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
           DISPLAY "CONSTANTES".
           DISPLAY 31.
           DISPLAY 23.23.
       PROGRAM-DONE.
           STOP RUN.
