       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
           DISPLAY 'HELLO WORLD'.
           DISPLAY 'Jujuba!'.
       PROGRAM-DONE.
           STOP RUN.
