       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG38.

       ENVIRONMENT DIVISION.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           COPY "CSELEC.cob".

       DATA DIVISION.
       FILE SECTION.
           COPY "CARQF.cob".

       WORKING-STORAGE SECTION.

       77  REGISTRO-ENCONTRADO        PIC X(01).
       77  CODIGO-FUNCIONARIO-ALTERAR PIC 9(05).
       77  QUAL-CAMPO                 PIC 9(01).

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.

           OPEN I-O ARQUIVO-FUNCIONARIO.
           PERFORM PEGA-REGISTRO-FUNCIONARIO.

           PERFORM ALTERAR-REGISTRO
               UNTIL FUNCIONARIO-CODIGO = ZEROES.

           CLOSE ARQUIVO-FUNCIONARIO.

       PROGRAM-DONE.
           STOP RUN.

       PEGA-REGISTRO-FUNCIONARIO.

           MOVE SPACE TO FUNCIONARIO-REGISTRO.
           MOVE ZEROS TO FUNCIONARIO-CODIGO.

           DISPLAY "INFORME O CODIGO DO FUNCIONARIO: ".
           ACCEPT CODIGO-FUNCIONARIO-ALTERAR.

           MOVE CODIGO-FUNCIONARIO-ALTERAR TO FUNCIONARIO-CODIGO.
           MOVE "N"                        TO REGISTRO-ENCONTRADO.

           PERFORM ENCONTRA-REGISTRO-FUNCIONARIO
               UNTIL REGISTRO-ENCONTRADO = "S" OR
                     FUNCIONARIO-CODIGO = ZEROES.

       ENCONTRA-REGISTRO-FUNCIONARIO.
           MOVE "S" TO REGISTRO-ENCONTRADO.
           READ ARQUIVO-FUNCIONARIO RECORD
            INVALID KEY
               MOVE "N" TO REGISTRO-ENCONTRADO.

           IF REGISTRO-ENCONTRADO = "N"
               DISPLAY "FUNCIONARIO INEXISTENTE!"
               DISPLAY "INFORME O CODIGO DO FUNCIONARIO:"
               ACCEPT CODIGO-FUNCIONARIO-ALTERAR
           .


       ALTERAR-REGISTRO.

           DISPLAY "".
           DISPLAY "CODIGO.....: " FUNCIONARIO-CODIGO.
           DISPLAY "1.NOME.....: " FUNCIONARIO-NOME.
           DISPLAY "2.ENDERECO.: " FUNCIONARIO-ENDERECO.
           DISPLAY "3.TELEFONE.: " FUNCIONARIO-TELEFONE.
           DISPLAY "4.EMAIL....: " FUNCIONARIO-EMAIL.

           DISPLAY "===================================="

           DISPLAY "DIGITE O NUMERO DO CAMPO".
           ACCEPT QUAL-CAMPO.

           IF QUAL-CAMPO > 4
               DISPLAY "CAMPO INVALIDO!".

           PERFORM MUDA-E-GRAVA-UM-CAMPO.

           PERFORM PEGA-REGISTRO-FUNCIONARIO.

       MUDA-E-GRAVA-UM-CAMPO.
           IF QUAL-CAMPO = 1
               DISPLAY "INFORME O NOME:"
               ACCEPT FUNCIONARIO-NOME
           .

           IF QUAL-CAMPO = 2
               DISPLAY "INFORME O ENDERECO:"
               ACCEPT FUNCIONARIO-ENDERECO
           .

           IF QUAL-CAMPO = 3
               DISPLAY "INFORME O TELEFONE:"
               ACCEPT FUNCIONARIO-TELEFONE
           .

           IF QUAL-CAMPO = 4
               DISPLAY "INFORME O EMAIL:"
               ACCEPT FUNCIONARIO-EMAIL
           .

           PERFORM REESCREVER-REGISTRO.

       REESCREVER-REGISTRO.
           REWRITE FUNCIONARIO-REGISTRO
             INVALID KEY
             DISPLAY "ERRO AO REESCREVER O REGISTRO!".
