       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG34.

       ENVIRONMENT DIVISION.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           COPY "CSELEC.cob".
      *     SELECT ARQUIVO-FUNCIONARIO
      *     ASSIGN TO "funcionarios.dat"
      *     ORGANIZATION IS INDEXED
      *     RECORD KEY IS FUNCIONARIO-CODIGO
      *     ACCESS MODE IS DYNAMIC.

           DATA DIVISION.
           FILE SECTION.
           COPY "CARQF.cob".
      *     FD ARQUIVO-FUNCIONARIO.
      * 01  FUNCIONARIO-REGISTRO.
      *     05 FUNCIONARIO-CODIGO   PIC 9(10).
      *     05 FUNCIONARIO-NOME     PIC X(20).
      *     05 FUNCIONARIO-ENDERECO PIC X(50).
      *     05 FUNCIONARIO-TELEFONE PIC X(15).
      *     05 FUNCIOARIO-EMAIL     PIC X(30).

       WORKING-STORAGE SECTION.

       01  RESPOSTA              PIC X(1).


       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
      *    =É COMUM CRIAR UM PROGRAMA PARA GERAR O ARQUIVO
           DISPLAY "INFORME C PARA CRIAR:"
           ACCEPT RESPOSTA

           IF RESPOSTA = "C"
               OPEN OUTPUT ARQUIVO-FUNCIONARIO

               CLOSE ARQUIVO-FUNCIONARIO
           ELSE

               OPEN I-O ARQUIVO-FUNCIONARIO

                   PERFORM LER-E-ESCREVE-REGISTRO

               CLOSE ARQUIVO-FUNCIONARIO.

       PROGRAM-DONE.
           STOP RUN.

       LER-E-ESCREVE-REGISTRO.

           MOVE SPACE TO FUNCIONARIO-REGISTRO.
           MOVE ZEROS TO FUNCIONARIO-CODIGO.

           DISPLAY "INFORME O CÓDIGO DO FUNCIONARIO...: "
           ACCEPT FUNCIONARIO-CODIGO.

           DISPLAY "INFORME O NOME DO FUNCIOARIO......: ".
           ACCEPT FUNCIONARIO-NOME.

           DISPLAY "INFORME O ENDERECO DO FUNCIONARIO.:".
           ACCEPT FUNCIONARIO-ENDERECO.

           DISPLAY "INFORME O TELEFONE DO FUNCIONARIO.:".
           ACCEPT FUNCIONARIO-TELEFONE.

           DISPLAY "INFORME O EMAIL DO FUNCIONARIO....:".
           ACCEPT FUNCIONARIO-EMAIL.

           WRITE FUNCIONARIO-REGISTRO.
