       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG5.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01  MINHA-MENSAGEM PIC X(200).
       01  NOME PIC X(10).
       01  NUMERO PIC 9(2).
       01  NUMERO-ADICAO PIC 9(10).

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.

       MOVE 'SEU NOME E SUA IDADE...' TO MINHA-MENSAGEM.
       MOVE 'ALAIN' TO NOME.
       MOVE 31 TO NUMERO.
       ADD 10 TO NUMERO-ADICAO.

       DISPLAY MINHA-MENSAGEM.
       DISPLAY NOME.
       DISPLAY NUMERO.
       DISPLAY NUMERO-ADICAO.

       PROGRAM-DONE.
           STOP RUN.
