       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG9.

       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01  MENSAGEM PIC X(20).

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
       PROGRAMA-DE-PERFORM.
           PERFORM MOVE-MENSAGEM.
           PERFORM EXIBE-MENSAGEM.
       PROGRAM-DONE.
           STOP RUN.

       MOVE-MENSAGEM.
           DISPLAY "DENTRO DE MOVE MENSAGEM".
           MOVE 'TESTE' TO MENSAGEM.

       EXIBE-MENSAGEM.
           DISPLAY "DENTRO DE EXIBE MENSAGEM".
           DISPLAY MENSAGEM.
