       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG39.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           COPY "CSELEC.cob".
       DATA DIVISION.
       FILE SECTION.
       COPY "CARQF.cob".

       WORKING-STORAGE SECTION.

       77  REGISTRO-ENCONTRADO        PIC X(01).

       77  CODIGO-FUNCIONARIO-EXCLUIR PIC 9(10).

       77  CONFIRMAR-EXCLUSAO         PIC X(01).

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.

           OPEN I-O ARQUIVO-FUNCIONARIO.

           PERFORM PEGA-REGISTRO-FUNCIONARIO.

           PERFORM DELETAR-REGISTRO
               UNTIL FUNCIONARIO-CODIGO = ZEROES.

           CLOSE ARQUIVO-FUNCIONARIO.

       PROGRAM-DONE.
           STOP RUN.

       PEGA-REGISTRO-FUNCIONARIO.

           MOVE SPACE TO FUNCIONARIO-REGISTRO.
           MOVE ZEROS TO FUNCIONARIO-CODIGO.

           DISPLAY "INFORME O CODIGO FUNCIONARIO:".
           ACCEPT CODIGO-FUNCIONARIO-EXCLUIR.

           MOVE CODIGO-FUNCIONARIO-EXCLUIR TO FUNCIONARIO-CODIGO.

           MOVE "N" TO REGISTRO-ENCONTRADO.

           PERFORM ENCONTRA-REGISTRO-FUNCIONARIO
               UNTIL REGISTRO-ENCONTRADO = "S" OR
               FUNCIONARIO-CODIGO = ZEROES.

       ENCONTRA-REGISTRO-FUNCIONARIO.
           MOVE "S" TO REGISTRO-ENCONTRADO.

           READ ARQUIVO-FUNCIONARIO RECORD
                INVALID KEY
                   MOVE "N" TO REGISTRO-ENCONTRADO.

           IF REGISTRO-ENCONTRADO = "N"
               DISPLAY "REGISTRO NAO ENCONTRADO"
               DISPLAY "INFORME O CODIGO DO FUNCIONARIO"
               ACCEPT CODIGO-FUNCIONARIO-EXCLUIR
           .

           MOVE CODIGO-FUNCIONARIO-EXCLUIR TO FUNCIONARIO-CODIGO.

       DELETAR-REGISTRO.

           DISPLAY "".
           DISPLAY "CODIGO.....: " FUNCIONARIO-CODIGO.
           DISPLAY "NOME.......: " FUNCIONARIO-NOME.
           DISPLAY "ENDERECO...: " FUNCIONARIO-ENDERECO.
           DISPLAY "TELEFONE...: " FUNCIONARIO-TELEFONE.
           DISPLAY "EMAIL......: " FUNCIONARIO-EMAIL.
           DISPLAY "===================================="

           MOVE "X" TO CONFIRMAR-EXCLUSAO.

           PERFORM PERGUNTA-EXCLUIR
              UNTIL CONFIRMAR-EXCLUSAO = "S" OR "N"

           IF CONFIRMAR-EXCLUSAO = "S"
               DELETE ARQUIVO-FUNCIONARIO RECORD
                 INVALID KEY
                 DISPLAY "ERRO AO EXCLUIR REGISTRO"
           .

           PERFORM PEGA-REGISTRO-FUNCIONARIO.

       PERGUNTA-EXCLUIR.
           DISPLAY "DESEJA EXCLUIR REGISTRO?".
           ACCEPT CONFIRMAR-EXCLUSAO.

           IF CONFIRMAR-EXCLUSAO = "s"
               MOVE "S" TO CONFIRMAR-EXCLUSAO
           .

           IF CONFIRMAR-EXCLUSAO = "n"
               MOVE "N" TO CONFIRMAR-EXCLUSAO
           .

           IF CONFIRMAR-EXCLUSAO NOT = "S" AND
              CONFIRMAR-EXCLUSAO NOT = "N"
              DISPLAY "VOCE DEVE ESCOLHER S OU N"
           .
